experiments/throughput_for_writes/logs/20181112161839/ratio1:0_run3_vclients24_workerthreads32_client2_instance2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      201505 ops,    2872 (avg:    2878) ops/sec, 11.32MB/sec (avg: 11.34MB/sec),  8.39 (avg:  8.33) msec latency

1         Threads
24        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        2920.04          ---          ---      8.33400     11785.37 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      2920.04         0.00         0.00      8.33400     11785.37 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.660         0.00
SET       0.710         0.00
SET       0.800         0.00
SET       0.820         0.00
SET       0.850         0.00
SET       0.880         0.00
SET       0.930         0.00
SET       0.940         0.00
SET       0.970         0.00
SET       0.980         0.01
SET       0.990         0.01
SET       1.000         0.01
SET       1.100         0.02
SET       1.200         0.04
SET       1.300         0.07
SET       1.400         0.10
SET       1.500         0.15
SET       1.600         0.21
SET       1.700         0.29
SET       1.800         0.40
SET       1.900         0.53
SET       2.000         0.72
SET       2.100         0.96
SET       2.200         1.25
SET       2.300         1.61
SET       2.400         2.02
SET       2.500         2.50
SET       2.600         3.00
SET       2.700         3.55
SET       2.800         4.16
SET       2.900         4.78
SET       3.000         5.42
SET       3.100         6.07
SET       3.200         6.74
SET       3.300         7.39
SET       3.400         8.01
SET       3.500         8.59
SET       3.600         9.20
SET       3.700         9.81
SET       3.800        10.39
SET       3.900        10.95
SET       4.000        11.52
SET       4.100        12.05
SET       4.200        12.61
SET       4.300        13.14
SET       4.400        13.66
SET       4.500        14.17
SET       4.600        14.67
SET       4.700        15.19
SET       4.800        15.66
SET       4.900        16.17
SET       5.000        16.65
SET       5.100        17.12
SET       5.200        17.60
SET       5.300        18.15
SET       5.400        18.65
SET       5.500        19.14
SET       5.600        19.70
SET       5.700        20.22
SET       5.800        20.78
SET       5.900        21.37
SET       6.000        22.00
SET       6.100        22.64
SET       6.200        23.31
SET       6.300        23.98
SET       6.400        24.65
SET       6.500        25.38
SET       6.600        26.18
SET       6.700        26.99
SET       6.800        27.82
SET       6.900        28.73
SET       7.000        29.67
SET       7.100        30.69
SET       7.200        31.75
SET       7.300        32.87
SET       7.400        34.08
SET       7.500        35.32
SET       7.600        36.68
SET       7.700        38.00
SET       7.800        39.47
SET       7.900        40.96
SET       8.000        42.46
SET       8.100        44.01
SET       8.200        45.60
SET       8.300        47.22
SET       8.400        48.90
SET       8.500        50.59
SET       8.600        52.33
SET       8.700        54.12
SET       8.800        55.96
SET       8.900        57.81
SET       9.000        59.75
SET       9.100        61.73
SET       9.200        63.65
SET       9.300        65.60
SET       9.400        67.60
SET       9.500        69.55
SET       9.600        71.50
SET       9.700        73.35
SET       9.800        75.17
SET       9.900        76.90
SET      10.000        83.92
SET      11.000        90.42
SET      12.000        93.69
SET      13.000        95.73
SET      14.000        97.04
SET      15.000        97.86
SET      16.000        98.41
SET      17.000        98.80
SET      18.000        99.08
SET      19.000        99.28
SET      20.000        99.44
SET      21.000        99.50
SET      22.000        99.53
SET      23.000        99.55
SET      24.000        99.57
SET      25.000        99.59
SET      26.000        99.62
SET      27.000        99.64
SET      28.000        99.66
SET      29.000        99.68
SET      30.000        99.69
SET      31.000        99.71
SET      32.000        99.72
SET      33.000        99.74
SET      34.000        99.76
SET      35.000        99.77
SET      36.000        99.79
SET      37.000        99.81
SET      38.000        99.83
SET      39.000        99.85
SET      40.000        99.87
SET      41.000        99.88
SET      42.000        99.89
SET      43.000        99.90
SET      44.000        99.91
SET      45.000        99.92
SET      46.000        99.93
SET      47.000        99.94
SET      48.000        99.95
SET      49.000        99.95
SET      50.000        99.96
SET      51.000        99.96
SET      52.000        99.96
SET      53.000        99.97
SET      54.000        99.97
SET      55.000        99.98
SET      56.000        99.98
SET      57.000        99.98
SET      58.000        99.99
SET      61.000        99.99
SET     170.000        99.99
SET     180.000        99.99
SET     190.000        99.99
SET     200.000       100.00
SET     210.000       100.00
SET     220.000       100.00
---
---