experiments/throughput_for_writes/logs/20181112161839/ratio1:0_run3_vclients24_workerthreads8_client1_instance1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      133146 ops,    2085 (avg:    1901) ops/sec, 8.22MB/sec (avg: 7.50MB/sec), 11.55 (avg: 12.61) msec latency

1         Threads
24        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1902.00          ---          ---     12.61400      7676.50 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1902.00         0.00         0.00     12.61400      7676.50 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.300         0.00
SET       1.500         0.00
SET       1.600         0.00
SET       1.700         0.00
SET       1.800         0.00
SET       1.900         0.01
SET       2.000         0.01
SET       2.100         0.01
SET       2.200         0.01
SET       2.300         0.02
SET       2.400         0.02
SET       2.500         0.02
SET       2.600         0.02
SET       2.700         0.03
SET       2.800         0.03
SET       2.900         0.04
SET       3.000         0.05
SET       3.100         0.05
SET       3.200         0.06
SET       3.300         0.07
SET       3.400         0.08
SET       3.500         0.09
SET       3.600         0.11
SET       3.700         0.12
SET       3.800         0.13
SET       3.900         0.15
SET       4.000         0.17
SET       4.100         0.20
SET       4.200         0.22
SET       4.300         0.25
SET       4.400         0.28
SET       4.500         0.33
SET       4.600         0.37
SET       4.700         0.41
SET       4.800         0.44
SET       4.900         0.48
SET       5.000         0.53
SET       5.100         0.58
SET       5.200         0.63
SET       5.300         0.68
SET       5.400         0.73
SET       5.500         0.79
SET       5.600         0.85
SET       5.700         0.91
SET       5.800         0.99
SET       5.900         1.07
SET       6.000         1.17
SET       6.100         1.28
SET       6.200         1.38
SET       6.300         1.49
SET       6.400         1.61
SET       6.500         1.74
SET       6.600         1.87
SET       6.700         2.01
SET       6.800         2.17
SET       6.900         2.34
SET       7.000         2.51
SET       7.100         2.74
SET       7.200         3.00
SET       7.300         3.29
SET       7.400         3.59
SET       7.500         3.90
SET       7.600         4.25
SET       7.700         4.61
SET       7.800         4.98
SET       7.900         5.36
SET       8.000         5.79
SET       8.100         6.25
SET       8.200         6.72
SET       8.300         7.28
SET       8.400         7.85
SET       8.500         8.45
SET       8.600         9.09
SET       8.700         9.75
SET       8.800        10.51
SET       8.900        11.30
SET       9.000        12.19
SET       9.100        13.13
SET       9.200        14.13
SET       9.300        15.19
SET       9.400        16.33
SET       9.500        17.52
SET       9.600        18.79
SET       9.700        20.10
SET       9.800        21.49
SET       9.900        22.98
SET      10.000        31.55
SET      11.000        47.11
SET      12.000        58.27
SET      13.000        66.42
SET      14.000        73.76
SET      15.000        80.62
SET      16.000        86.33
SET      17.000        90.34
SET      18.000        93.24
SET      19.000        95.56
SET      20.000        97.14
SET      21.000        98.02
SET      22.000        98.53
SET      23.000        98.83
SET      24.000        99.04
SET      25.000        99.18
SET      26.000        99.27
SET      27.000        99.37
SET      28.000        99.44
SET      29.000        99.50
SET      30.000        99.56
SET      31.000        99.60
SET      32.000        99.64
SET      33.000        99.65
SET      34.000        99.67
SET      35.000        99.70
SET      36.000        99.74
SET      37.000        99.77
SET      38.000        99.80
SET      39.000        99.82
SET      40.000        99.83
SET      41.000        99.86
SET      42.000        99.88
SET      43.000        99.90
SET      44.000        99.91
SET      45.000        99.92
SET      46.000        99.93
SET      47.000        99.94
SET      48.000        99.95
SET      49.000        99.96
SET      50.000        99.96
SET      51.000        99.96
SET      52.000        99.96
SET      53.000        99.96
SET      55.000        99.96
SET      56.000        99.97
SET      57.000        99.97
SET      58.000        99.97
SET      59.000        99.98
SET      60.000        99.98
SET      63.000        99.98
SET      72.000        99.98
SET      73.000        99.98
SET      74.000        99.98
SET      76.000        99.99
SET      77.000        99.99
SET      78.000        99.99
SET      79.000       100.00
SET      81.000       100.00
SET      82.000       100.00
SET      83.000       100.00
---
---