experiments/throughput_for_writes/logs/20181112161839/ratio1:0_run3_vclients24_workerthreads8_client2_instance2.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  70 secs]  0 threads:      136157 ops,    1884 (avg:    1944) ops/sec, 7.43MB/sec (avg: 7.67MB/sec), 12.74 (avg: 12.34) msec latency

1         Threads
24        Connections per thread
70        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets        1944.89          ---          ---     12.33600      7849.63 
Gets           0.00         0.00         0.00      0.00000         0.00 
Waits          0.00          ---          ---      0.00000          --- 
Totals      1944.89         0.00         0.00     12.33600      7849.63 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.100         0.00
SET       1.200         0.00
SET       1.300         0.01
SET       1.400         0.01
SET       1.600         0.01
SET       1.700         0.01
SET       1.800         0.02
SET       1.900         0.02
SET       2.000         0.02
SET       2.100         0.02
SET       2.200         0.02
SET       2.300         0.03
SET       2.400         0.03
SET       2.500         0.04
SET       2.600         0.05
SET       2.700         0.06
SET       2.800         0.06
SET       2.900         0.07
SET       3.000         0.08
SET       3.100         0.10
SET       3.200         0.11
SET       3.300         0.13
SET       3.400         0.14
SET       3.500         0.16
SET       3.600         0.18
SET       3.700         0.20
SET       3.800         0.22
SET       3.900         0.25
SET       4.000         0.27
SET       4.100         0.30
SET       4.200         0.33
SET       4.300         0.37
SET       4.400         0.41
SET       4.500         0.45
SET       4.600         0.49
SET       4.700         0.54
SET       4.800         0.60
SET       4.900         0.65
SET       5.000         0.70
SET       5.100         0.76
SET       5.200         0.82
SET       5.300         0.89
SET       5.400         0.94
SET       5.500         0.99
SET       5.600         1.07
SET       5.700         1.15
SET       5.800         1.23
SET       5.900         1.32
SET       6.000         1.42
SET       6.100         1.52
SET       6.200         1.65
SET       6.300         1.76
SET       6.400         1.86
SET       6.500         1.99
SET       6.600         2.13
SET       6.700         2.29
SET       6.800         2.49
SET       6.900         2.69
SET       7.000         2.87
SET       7.100         3.08
SET       7.200         3.30
SET       7.300         3.54
SET       7.400         3.82
SET       7.500         4.10
SET       7.600         4.38
SET       7.700         4.72
SET       7.800         5.09
SET       7.900         5.46
SET       8.000         5.87
SET       8.100         6.34
SET       8.200         6.84
SET       8.300         7.35
SET       8.400         7.92
SET       8.500         8.53
SET       8.600         9.21
SET       8.700         9.92
SET       8.800        10.71
SET       8.900        11.53
SET       9.000        12.51
SET       9.100        13.54
SET       9.200        14.69
SET       9.300        15.84
SET       9.400        17.16
SET       9.500        18.50
SET       9.600        19.99
SET       9.700        21.51
SET       9.800        23.22
SET       9.900        25.02
SET      10.000        35.36
SET      11.000        52.13
SET      12.000        62.73
SET      13.000        70.28
SET      14.000        76.80
SET      15.000        83.21
SET      16.000        88.53
SET      17.000        91.87
SET      18.000        94.19
SET      19.000        96.11
SET      20.000        97.35
SET      21.000        98.10
SET      22.000        98.54
SET      23.000        98.83
SET      24.000        99.01
SET      25.000        99.15
SET      26.000        99.25
SET      27.000        99.38
SET      28.000        99.46
SET      29.000        99.52
SET      30.000        99.57
SET      31.000        99.61
SET      32.000        99.64
SET      33.000        99.66
SET      34.000        99.68
SET      35.000        99.70
SET      36.000        99.72
SET      37.000        99.73
SET      38.000        99.76
SET      39.000        99.78
SET      40.000        99.80
SET      41.000        99.83
SET      42.000        99.87
SET      43.000        99.89
SET      44.000        99.91
SET      45.000        99.92
SET      46.000        99.93
SET      47.000        99.94
SET      48.000        99.96
SET      49.000        99.97
SET      50.000        99.98
SET      52.000        99.98
SET      53.000        99.98
SET     200.000        99.98
SET     210.000        99.99
SET     220.000       100.00
---
---